---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.Camera
source: html/7dc3bf8e-227d-376a-a6fd-bf172a7c5714.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera

A collection of camera settings for the current view.

## Syntax (C#)
```csharp
public class Camera : IDisposable
```

## Remarks
The current Camera can be obtained from DrawContext